[
  {
    "id": "01",
    "locale": "en",
    "title": "Hello to the Internet!",
    "subheader": "May 12, 2017",
    "image": "/blogs/blog1.jpeg",
    "image2": "/blogs/blog1-2.jpeg",
    "image3": "/blogs/blog1-3.jpeg",
    "image4": "/blogs/blog1-4.jpeg",
    "description": "Well well well, after five years since our grand opening in 2012, we finally found some time away from manning",
    "delay": 100,
    "p1": "Well well well, after five years since our grand opening in 2012, we finally found some time away from manning the shop (along with some discipline to leave our rods alone) and got to launching our website!\nFor our fishing friends and long time customers, we know what you are thinking… it is about time!\nAnd of course for new faces to the shop… Welcome to First Light Fishing & Tackle!",
    "p2": "Our vision is to continue to share our passion in recreational fishing with other anglers and as well as offer our knowledge, products, and services to those fishing in our beautiful waters of British Columbia. Ultimately, we are a hub for those who simply live, love, and fish. Here is the game plan First Light Fishing & Tackle and what everyone can expect from our first steps into the web:",
    "p3": "Fresh content providing insight and resourceful knowledge about varying fishing topics of interest. The content we cover will be entertaining, educational and yet at times refreshing compared to other conventional fishing reads.",
    "p4": "Here is the game plan First Light Fishing & Tackle and what everyone can expect from our first steps into the web:",
    "p5": "Fresh content providing insight and resourceful knowledge about varying fishing topics of interest. The content we cover will be entertaining, educational and yet at times refreshing compared to other conventional fishing reads.",
    "p6": "Some posts may contain updates in local fisheries, some will discuss fish behaviour, or introduce new fishing techniques particularly productive in our waters (it will be difficult to keep Steven from sharing ALL of his secrets!). ",
    "p7": "Meanwhile some of our other blogs might just genuinely geek over new fishing tackle and showcase their effective functions.",
    "p8": "We will also be taking an active role in social media and events to continue to connect with BC's fishing community and reach out to new and veteran anglers alike. ",
    "p9": "There is a lot more to come, but we don’t want to spoil all the fun and surprise yet! Overall, we’re very excited to get the ball rolling and hope that our content can further grow your passion for recreational fishing. Feel free to visit the shop and come share your fishing stories and adventures with us. Meet as a fellow angler and leave as a friend!",
    "p10": "A big shout out to all of our close friends and fishing companions who have supported us throughout these growing years (you know who you are). All the fish we hooked, roads traveled, and memories we share have developed into all these awesome friendships! First Light Fishing & Tackle is here today because of your support, so we hope this website and it’s contents can be our way of showing you how much we appreciate you guys! Be sure to check out the rest of our blogs, products section, and services to see what we're all about! Stay tuned… more hidden away in our tackle box..."
  },
  {
    "id": "02",
    "locale": "en",
    "title": "Story Behind The Vision",
    "subheader": "May 13, 2017",
    "image": "/blogs/blog2.jpeg",
    "image2": "/blogs/blog2-2.jpeg",
    "image3": "/blogs/blog2-3.jpeg",
    "image4": "/blogs/blog2-4.jpeg",
    "description": "Fishing sure can be an unpredictable activity, sometimes it is fast paced and exciting when your rod is fully bent",
    "delay": 200,
    "p1": "Fishing sure can be an unpredictable activity, sometimes it is fast paced and exciting when your rod is fully bent with a fish on the other end of your line… while other times the fish just ain’t having it and it slows down as if you were only out on the water to soul search in the solitude of nature. Earlier this year when chasing some winter steelheads, it certainly was the latter for some of us here at First Light Fishing & Tackle.",
    "p2": "During this temporary down time, we certainly got to thinking about our direction into our store’s fifth year anniversary and started reflecting upon the reasons that push us towards chasing our vision and goals. For those who’ve already read our earlier blog, you may already know that First Light Fishing & Tackle’s vision is to share our fishing passion and connect with other anglers in the fishing community. What you may question though is why? Why is sharing the passion so essential to First Light and what drives us to continue to pursue this specific vision?",
    "p3": "Well other than the great friends you make, awesome fishing gear, and hooking plenty of fish, the main reason behind our vision stems from many years ago when a little boy broke open his piggy bank to purchase his very first set of fishing tackle.",
    "p4": "Like many of us, Steven first experienced fishing at a young age when he accompanied both his Dad and Grandfather on their frequent fishing outings. After being immediately hooked into the sport, he took what little savings any 7 year old would have and went to the local fishing shop. Not even tall enough to see past the front counter of the store, Steven asked the owner what he could get with his hard earned budget of twenty dollars. Seeing all the measly loose coins up on his counter, the shopkeeper decided to give a special discount on his most basic rod outfit to the boy, a crude yet simple bamboo rod with only a line and hook at the end.",
    "p5": "Afterwards, the boy walked out of the store proudly with his first fishing rod in hand and started chasing his passion for fishing. Steven recalls now that the rod he got was probably the cheapest set up in the store, but the advice, encouragement, and gesture offered by the shopkeeper is something he will remember forever.",
    "p6": "A few years passed and the boy became an avid 15 year old angler who spent much of his time on the water learning from veteran fishermen and further honing his skill set by fishing in lakes, ponds, sloughs, rivers, and any pocket of water that was fishable! In fact, Steven became so enticed by fishing that he might have even skipped school once or twice… to the point where his parent became concerned that he wasn’t concentrating on his schooling. Ultimately Steven’s parents decided to immigrate from Taiwan to Canada in hopes of providing a better future for the family as well as a less distracting environment for Steven. Ironically, little did they know at the time, Vancouver was actually a world class fishing destination!",
    "p7": "Having said that however, Steven’s first couple of years in Vancouver proved to be a tough transition. The language barrier, unfamiliarity, and lack of fishing friends disconnected him from what he loved doing the most. Undeterred by these challenges and spurred on by his passion for fishing, Steven overcame these obstacles and continued to pursue his craft which eventually led him to establish new friendships and inevitably open the doors to connect with the fishing community in Vancouver. During this time with the help of his new fishing friends, he rapidly learned and picked up all the different fishing techniques and fisheries that BC had to offer, ranging from chasing trout from urban lakes to the interior on the fly, trolling & jigging salmon, bottom fishing up and down the coast, drift fishing steelheads & chars in tributaries, tenkara fishing carp & coarse fish in local sloughs, and lastly tackling on far and “unnamed” bodies of water (angler’s secret spots, you know how it is).",
    "p8": "After post-secondary graduation and countless hours out on the water in diverse systems, a mid-twenty something Steven found himself managing for a local fishing tackle shop (apparently he got this opportunity simply by showing them pictures of his trophy catches… if only some of our interviews were like that!). He recalls during those days is where he further developed a passion to teach others about fishing and thoroughly enjoyed helping others in learning about different techniques, appropriate tackle, and fishing fundamentals. The more his connections and friendships grew, the more Steven began to dream how he could continue to share his passion to teach about fishing and take it to the next level.",
    "p9": "Fast forward a few years later, Steven actualized his vision and opened the doors of First Light Fishing & Tackle for the first time!  From his memories of the shopkeeper who gave him his first rod to connecting the cultural gap with other anglers in Vancouver, Steven drew inspiration from his past experiences and proudly instills his passion for fishing into our store’s culture and services.",
    "p10": "Guess just chasing winter steelheads isn't the only rewarding thing, but our dreams as well... Be sure to come visit us in the shop so you share your passion for fishing too!"


  },
  {
    "id": "03",
    "locale": "en",
    "title": "CARP BEHAVIOUR 101",
    "subheader": "May 14, 2017",
    "image": "/blogs/blog3.jpeg",
    "image2": "/blogs/blog3-2.jpeg",
    "image3": "/blogs/blog3-3.jpeg",
    "image4": "/blogs/blog3-4.jpeg",
    "description": "At First Light Fishing & Tackle, one of our most favourite fish species to target is carp. Intelligent, adaptable, and",
    "delay": 300,
    "p1": "At First Light Fishing & Tackle, one of our most favourite fish species to target is carp. Intelligent, adaptable, and puts up a solid fight, it’s easy to understand why the Golden Ghost is one of the most sought after fish by anglers around the world.",
    "p2": "Despite being internationally renowned as a gamefish, carp have endured an infamous reputation amongst our local waters because they are often perceived as a dangerously invasive and non-sport fish species here in British Columbia. This negative spotlight is further fuelled due to the media exposure of the carp invasion in the Mississippi River and other water ways along the east coast leading up to the Great Lakes.",
    "p3": "However, we need to emphasize that the overpopulated carp seen jumping all over the place in eastern systems are completely unalike to the Common and Mirror carp we encounter here in Western Canada. Each type of carp behaves quite differently and the ones in BC are certainly not a threat to our waters to the degree of those shown by Asian and Silver carp in the east.",
    "p4": "Although the carp stigma may still loom about, recent years has demonstrated that there has been an emerging interest in this fishery and we hope that this brief blog about carp behaviour can further grow your appreciation for these fish as well as help you target them!",
    "p5": "As mentioned earlier, the two main type of carp that can be found in BC are the Common and Mirror carp. You can distinguish between the two based on the pattern of their scales. The Common carp typically has consistent shiny scales covering from the end of the gill plate to the tail, while the Mirror carp carries a more distinct pattern of scales with scaleless patches in between. There may be times where you initially think you’ve landed a Mirror carp because of a couple of missing scales, but rest assured if the rest of the scales are full and consistent it may just be a Common carp that had some skin breaks due to buckling with other carp. Both types of carp are schooling fish that often travels with 5 to 6 others. Females tend to have a bulkier body, meanwhile the males are more slimmer and slender. Unlike the domesticated carp (the huge ones that are fed to grow up to 80lbs!), the majority of BC carp are wild so they range between 5 to 20lbs and in some opinions put up a better fight pound for pound compared to their European relatives (kinda like stocked trout vs wild). Having said that however, we wouldn’t be surprised to hear stories about lurkers extending past that range since carp have faced little fishing pressure in BC.",
    "p6": "While carp are opportunistic feeders to what is available and very versatile in adapting to their surroundings, there are a few common things they consistently feed upon in their natural diet across different bodies of water. Their natural diet consists of aquatic insects (nymphs and chironomids), blood worms, underwater snails, the tender parts of aquatic plant roots, and sometimes even small crayfish. Some human edibles are also part of the carp’s favourite delicacies, such as corn, seeds, oat & grain substances, and fallen berries from nearby bushes or farms.",
    "p7": "Carp find these different foods with their sensitive mouth where concentrated nerves around their lips help them detect their next meal. The nerves in their short whiskers also play a part in sensing and assists in distinguishing between food and inedible objects in the water. Most of it’s diet are found near lying at the bottom, so BC carp have a habit of mid to bottom feeding as a result. Once something of interest has been located, the carp will not immediately commit to engulfing the food like trout or bass because of the anatomy of their soft mouth. Instead, the carp will extend their lips a little bit to slowly suck in and then spit out the object to investigate the potential meal. In addition to all this, carp also have keen eyesight and a great sense of smell to help them sort out what is edible and what is not. Ultimately, thanks to their cautious feeding behaviour and sensory skills, carp can be an elusive yet rewarding fish to target.",
    "p8": "Besides understanding their feeding diet and habit, there are two other factors that could help increase your chances of encountering carp. The first is location. Since their body structure is bulkier and not as streamlined as some of other BC fish species, carp prefer to lurk in still/slow moving water such as sloughs, lakes and ponds.",
    "p9": "he second key factor is water temperature. Carp tend to be more active in warmer waters after the ice has melted and some sunlight have heated things up. The rise in water temperature allows the aquatic life that carp feed on to emerge and as well as enhances their scent, prompting the carp to begin actively feeding in shallower waters. The ideal water temperature for carp fishing will vary between the opinions of each angler, but at First Light we have generally found approximate levels of 15 degrees will get the job done.",
    "p10": "So the warmer the water, the higher chance the carp are actively feeding right? Not necessarily. Carp spawning seasons are also determined by water temperature and once the more focused they are on spawning the less they are thinking about feeding. Since the water temperature may fluctuate between ideal and too high during the spring and summer months, carp may be spawning multiple times a year. To anticipate the feeding times of carp, it would be more accurate to observe the temperature rather than basing it off on what month it is. Once you begin to stumble upon their sticky eggs around submerged structures, plant roots & lilies or start seeing consistent topwater splashes from carp (hormones kicking in), chances are the carp are in spawning mode! If we did have to label the months for carp fishing then late April to Early May is a good start, fair chances from June to August in slightly deeper waters, and September to early October is when the carp actively fatten up before their Winter hibernation.",
    "p11": "Now that some of the essentials to carp behaviour in BC have been covered, we at First Light Fishing & Tackle, hope this insight will help you in better understanding the carp's mindset and ultimately contribute to your knowledge in targeting them as well. Though the Golden Ghosts may appear hidden away, they are definitely subtlety cruising along our local waters and waiting to test the next angler they run into. If you've got any more questions on these spectacular gamefish, feel free to pop by in the store! If not, we'll see you on the water!"

  
  },
  {
    "id": "04",
    "locale": "zh",
    "title": "故事的背後及店長簡介!",
    "subheader": "五月 12, 2017",
    "image": "/blogs/blog1.jpeg",
    "image2": "/blogs/blog1-2.jpeg",
    "image3": "/blogs/blog1-3.jpeg",
    "image4": "/blogs/blog1-4.jpeg",
    "description": "Well well well, after five years since our grand opening in 2012, we finally found some time away from manning",
    "delay": 100,
    "p1": "Well well well, after five years since our grand opening in 2012, we finally found some time away from manning the shop (along with some discipline to leave our rods alone) and got to launching our website! For our fishing friends and long time customers, we know what you are thinking… it is about time! And of course for new faces to the shop… Welcome to First Light Fishing & Tackle!",
    "p2": "Our vision is to continue to share our passion in recreational fishing with other anglers and as well as offer our knowledge, products, and services to those fishing in our beautiful waters of British Columbia. Ultimately, we are a hub for those who simply live, love, and fish. Here is the game plan First Light Fishing & Tackle and what everyone can expect from our first steps into the web:",
    "p3": "• Fresh content providing insight and resourceful knowledge about varying fishing topics of interest. The content we cover will be entertaining, educational and yet at times refreshing compared to other conventional fishing reads. \n• Some posts may contain updates in local fisheries, some will discuss fish behaviour, or introduce new fishing techniques particularly productive in our waters (it will be difficult to keep Steven from sharing ALL of his secrets!). \n• Meanwhile some of our other blogs might just genuinely geek over new fishing tackle and showcase their effective functions. \n• We will also be taking an active role in social media and events to continue to connect with BC's fishing community and reach out to new and veteran anglers alike. ",
    "p4": "There is a lot more to come, but we don’t want to spoil all the fun and surprise yet! Overall, we’re very excited to get the ball rolling and hope that our content can further grow your passion for recreational fishing. Feel free to visit the shop and come share your fishing stories and adventures with us. Meet as a fellow angler and leave as a friend!",
    "p5": "A big shout out to all of our close friends and fishing companions who have supported us throughout these growing years (you know who you are). All the fish we hooked, roads traveled, and memories we share have developed into all these awesome friendships! First Light Fishing & Tackle is here today because of your support, so we hope this website and it’s contents can be our way of showing you how much we appreciate you guys! Be sure to check out the rest of our blogs, products section, and services to see what we're all about! Stay tuned… more hidden away in our tackle box..."
  },
  {
    "id": "05",
    "locale": "zh",
    "title": "新手入門掃盲!",
    "subheader": "五月 12, 2017",
    "image": "/blogs/blog2.jpeg",
    "image2": "/blogs/blog2-2.jpeg",
    "image3": "/blogs/blog2-3.jpeg",
    "image4": "/blogs/blog2-4.jpeg",
    "description": "Well well well, after five years since our grand opening in 2012, we finally found some time away from manning",
    "delay": 200,
    "p1": "Well well well, after five years since our grand opening in 2012, we finally found some time away from manning the shop (along with some discipline to leave our rods alone) and got to launching our website! For our fishing friends and long time customers, we know what you are thinking… it is about time! And of course for new faces to the shop… Welcome to First Light Fishing & Tackle!",
    "p2": "Our vision is to continue to share our passion in recreational fishing with other anglers and as well as offer our knowledge, products, and services to those fishing in our beautiful waters of British Columbia. Ultimately, we are a hub for those who simply live, love, and fish. Here is the game plan First Light Fishing & Tackle and what everyone can expect from our first steps into the web:",
    "p3": "• Fresh content providing insight and resourceful knowledge about varying fishing topics of interest. The content we cover will be entertaining, educational and yet at times refreshing compared to other conventional fishing reads. \n• Some posts may contain updates in local fisheries, some will discuss fish behaviour, or introduce new fishing techniques particularly productive in our waters (it will be difficult to keep Steven from sharing ALL of his secrets!). \n• Meanwhile some of our other blogs might just genuinely geek over new fishing tackle and showcase their effective functions. \n• We will also be taking an active role in social media and events to continue to connect with BC's fishing community and reach out to new and veteran anglers alike. ",
    "p4": "There is a lot more to come, but we don’t want to spoil all the fun and surprise yet! Overall, we’re very excited to get the ball rolling and hope that our content can further grow your passion for recreational fishing. Feel free to visit the shop and come share your fishing stories and adventures with us. Meet as a fellow angler and leave as a friend!",
    "p5": "A big shout out to all of our close friends and fishing companions who have supported us throughout these growing years (you know who you are). All the fish we hooked, roads traveled, and memories we share have developed into all these awesome friendships! First Light Fishing & Tackle is here today because of your support, so we hope this website and it’s contents can be our way of showing you how much we appreciate you guys! Be sure to check out the rest of our blogs, products section, and services to see what we're all about! Stay tuned… more hidden away in our tackle box..."
  },
  {
    "id": "06",
    "locale": "zh",
    "title": "裝備論!",
    "subheader": "五月 12, 2017",
    "image": "/blogs/blog3.jpeg",
    "image2": "/blogs/blog3-2.jpeg",
    "image3": "/blogs/blog3-3.jpeg",
    "image4": "/blogs/blog3-4.jpeg",
    "description": "Well well well, after five years since our grand opening in 2012, we finally found some time away from manning",
    "delay": 300,
    "p1": "Well well well, after five years since our grand opening in 2012, we finally found some time away from manning the shop (along with some discipline to leave our rods alone) and got to launching our website! For our fishing friends and long time customers, we know what you are thinking… it is about time! And of course for new faces to the shop… Welcome to First Light Fishing & Tackle!",
    "p2": "Our vision is to continue to share our passion in recreational fishing with other anglers and as well as offer our knowledge, products, and services to those fishing in our beautiful waters of British Columbia. Ultimately, we are a hub for those who simply live, love, and fish. Here is the game plan First Light Fishing & Tackle and what everyone can expect from our first steps into the web:",
    "p3": "• Fresh content providing insight and resourceful knowledge about varying fishing topics of interest. The content we cover will be entertaining, educational and yet at times refreshing compared to other conventional fishing reads. \n• Some posts may contain updates in local fisheries, some will discuss fish behaviour, or introduce new fishing techniques particularly productive in our waters (it will be difficult to keep Steven from sharing ALL of his secrets!). \n• Meanwhile some of our other blogs might just genuinely geek over new fishing tackle and showcase their effective functions. \n• We will also be taking an active role in social media and events to continue to connect with BC's fishing community and reach out to new and veteran anglers alike. ",
    "p4": "There is a lot more to come, but we don’t want to spoil all the fun and surprise yet! Overall, we’re very excited to get the ball rolling and hope that our content can further grow your passion for recreational fishing. Feel free to visit the shop and come share your fishing stories and adventures with us. Meet as a fellow angler and leave as a friend!",
    "p5": "A big shout out to all of our close friends and fishing companions who have supported us throughout these growing years (you know who you are). All the fish we hooked, roads traveled, and memories we share have developed into all these awesome friendships! First Light Fishing & Tackle is here today because of your support, so we hope this website and it’s contents can be our way of showing you how much we appreciate you guys! Be sure to check out the rest of our blogs, products section, and services to see what we're all about! Stay tuned… more hidden away in our tackle box..."
  }
]