 [
    {
        "id": "01",
        "href": "freshwater",
        "title": "FRESH WATER",
        "img1": "/product/introImg1-1.jpeg",
        "img2": "/product/introImg1-2.jpeg",
        "img3": "/product/introImg1-3.jpeg",
        "intro1": "For your freshwater fishing needs, First Light Fishing & Tackle has all the essential fishing gear you're looking for! We carry a variety of gear from brands such as Shimano, G.Loomis, Redington, Islander, Trophy XL, Raven, Daiwa, Maruto, and the list goes on.",
        "intro2": "Here at First Light Fishing & Tackle, the selection of products we carry is indeed also what we personally fish with. So whether you're fishing with a spinning reel, a baitcaster, or float drifting with a centrepin, come check out some of our fishing gear that will enhance your experience or productivity at your favourite runs and secret spots. Better yet, visit us and replenish your tackle box with some fishing necessities like various lines, leaders, sinkers, floats, hooks and other terminal gear.",
        "intro3" :"Moreover, if you are a gear geek and love to build your own design of spinners, jigs, spoons and other fishing lures... then look no further because First Light Fishing & Tackle stocks an assortment of lure building components such as blades, hooks, beads, split rings, and other various tinkering pieces.",
        "intro4": "Looking for something stronger? We also have fresh bait such as cured salmon roe, krill shrimp, sturgeon bait, scented oils, brine, egg cure and some classics like live dew worms and Powerbait.",
        "intro5": "Be sure to add some new toys to your fishing arsenal like bright jigs, attractive lures, subtle soft plastics, or even our in house fishing tackle used by our staff every time we head out to the water."
    },
    {
        "id": "02",
        "href": "saltwater",
        "title": "SALT WATER",
        "img1": "/product/introImg2-1.jpeg",
        "img2": "/product/introImg2-2.jpeg",
        "img3": "/product/introImg2-3.jpeg",
        "intro1": "Whether you're shore casting from the beach or trolling around the beautiful waters of the west coast, First Light Fishing & Tackle provides the necessities and fishing gear you need for your saltwater adventure. ",
        "intro2": "From buzzbombs, salmon trolling spoons, hoochies, teaserheads, lead jigs, mooching rod & reel combos, flashers, down riggers, cannonball sinkers, the list goes on! And of course we carry fresh bait like anchovies and herring to add a little incentive for the fish to bite. ",
        "intro3": "In addition, First Light Fishing & Tackle also has crabbing and prawn trapping gear. So why not try your luck with the crustaceans while you're taking in the coastal scenery and waiting to hook up your fish.",
        "intro4": "Feel free to come visit us at the shop to ask any questions or check out what other fishing gear we have in store. And remember at First Light Fishing & Tackle what we stock is also what we choose to fish with because... Fishing Is Our Life!",
        "intro5":""
    },
    {
        "id": "03",
        "href": "flyfishing",
        "title": "FLY FISHING",
        "img1": "/product/introImg3-1.jpeg",
        "img2": "/product/introImg3-2.jpeg",
        "img3": "/product/introImg3-3.jpeg",
        "intro1": "The tug is the drug! There is nothing like feeling a direct pull from an initial bite of a fish as you're stripping in your streamer or watching your carefully presented dry fly get chomped on as it drifts by a fishy run. Fly fishing certainly is rewarding way to fish and here at First Light Fishing & Tackle, we've got what you need to match the hatch. Some fly fishing brands we carry includes RIO, G.Loomis, Redington, Dragonfly, Superfly, Wapsi, Hareline, Amundsen, and many others!",
        "intro2": "If you're looking to switch up your lines, come down to the store to check out our fly line assortment, ranging from floating, intermediate, spey, skagit, sink tip and switch. ",
        "intro3": "nterested in fly fishing, but not sure where to start? We can help you get the ball rolling with a variety rod and reel combos, fly lines, tapered leaders, fluorocarbon tippets, backing, and of course some essential made in house dry flies, streamers, and nymphs.",
        "intro4": "At First Light Fishing & Tackle, we also have a great selection of different fly tying material and tools for those who love to create their own unique patterns and designs, such as marabou, chenille, bucktail, rabbit strips, fly hooks, and dubbing material to name a few. And for those who are intrigued to getting introduced to fly tying, we've also got a fly tying entry kit to help you hooked on making your own flies. Definitely feel free to visit us at the shop to check what we got in store and ask us any questions you have.  Remember, at First Light Fishing & Tackle... what we carry is also what we choose to fish with because Fishing Is Our Life! ",
        "intro5":""
    },
    {
        "id": "04",
        "href": "crap",
        "title": "CRAP & COARSE",
        "img1": "/product/introImg4-1.jpeg",
        "img2": "/product/introImg4-2.jpeg",
        "img3": "/product/introImg4-3.jpeg",
        "intro1": "Often underrated, carp and many other coarse fish species are great fisheries in the lower mainland and can offer an enjoyable time on out the water. ",
        "intro2": "For those who have hooked up carp before, we know that these fish can take off like a freight train as well as sometimes test our angling know how. Though the carp's fickle behaviour, sharp intellect, and delicate mouth can really push the limits of a fisherman's patience, it is certainly very rewarding when you finally hook and land one! ",
        "intro3": "If you're a big time carp fishermen or looking to get started, then you've definitely found the right tackle store because First Light Fishing & Tackle carries the largest selection of carp fishing tackle in the lower mainland. Tenkara rods, bait runner spinning reels, carp rigs, carp floats, in house made ground bait and boilies are just a few of our specialized carp fishing products! In addition, our staff loves to carp fish and are well experienced so feel free to come visit us in store to ask any questions or get some advice on how to target this underrated fishery!",
        "intro4": "Other coarse species can also offer memorable and diverse fishing experiences, such as northern pikeminnows, sunfish, brown bullheads, bass, crappies, sunfish, peamouth chubs and many others that lurk in our waters close to home. These fish are often abundant, aggressive, and always a fun alternative to other popular targeted fisheries. Moreover, these are ideal fish for introducing fishing to kids, new anglers or even for experienced hands looking to scratch their fishing itch. Be sure to come on down to check out our other coarse fishing tackle and remember that at First Light Fishing & Tackle... we only carry what we personally fish with because Fishing Is Our Life!",
        "intro5":""
    },{
        "id": "05",
        "href": "tools",
        "title": "APPAREL & ACCESSORIES",
        "img1": "/product/introImg5-1.jpeg",
        "img2": "/product/introImg5-2.jpeg",
        "img3": "/product/introImg5-3.jpeg",
        "intro1": "Getting ready and prepping to head out to your next fishing trip is always an exciting routine. Either you're making sure that your tackle box is fully stocked and that you didn't forget anything or constantly checking the weather forecast, there are certainly more than a handful of elements that the avid angler must prepare for.",
        "intro2": "Having said that however, as thorough and organized as we like to think we are with our tackle, there are times when even fishing veterans forget to bring the additional accessories that make our fishing experience more convenient and complete.",
        "intro3": "For moments like this, First Light Fishing & Tackle has got you covered! Come on down to the shop and go through your checklist of essential accessories, such as pliers, forceps, landing nets, fish scale, hook sharpener, scissors, polarized sunglasses, filet knives, and even bear spray. We also have fishing guide books revealing maps, trails, and depth charts of many local bodies of fishy water.",
        "intro4": "No more room to carry? That's why we have a variety of backpacks, waist packs, and tackle boxes to choose from to help you bring everything you want. ",
        "intro5":"Not a fairweather angler and wanting to brave the rough weather? We applaud your determination at First Light Fishing & Tackle! Check out what we have in store to keep you dry and warm, such as hip & chest waders, wading jackets, rain headgear, wading boots, gloves, and wader repair kit. Feel free to drop by if you have any questions and see what we got in stock. Remember, at First Light Fishing & Tackle we recommend what we personally choose to fish because... Fishing Is Our Life!"
    },
    {
        "id": "06",
        "href": "freshwater",
        "title": "淡水釣具",
        "img1": "/product/introImg1-1.jpeg",
        "img2": "/product/introImg1-2.jpeg",
        "img3": "/product/introImg1-3.jpeg",
        "intro1": "在卑詩省淡水釣可以說是我們的未來，在這片廣大的地方分佈著數不清的大小天然湖泊，有的甚至連名子都沒有，加上千千萬萬的小溪，沼澤 還有數以百計的大河，淡水資源和魚種相當的豐富。我們的淡水裝備提供了釣友非常多元化的選擇，各種長度/比重的路亞竿，紡車/槍柄/漂流/拖釣/鱘龍竿 等 各式不同的捲線器 紡車/鼓輪/水滴輪/漂流/電動 等等。",
        "intro2": "我們所代理的品牌眾多 Shimano, G.Loomis, Daiwa, Trophy XL, Raven, Redington, Islander, Ryobi, Maruto Amundson 等。",
        "intro3" :"各式假餌，路亞，勺子，亮片，軟餌   等。各種魚線，尼龍/碳線/PE 等 還有各式釣魚小配件 浮標，鉛 ，轉圜，魚鉤 等 我們也有好品質的生餌 如 活蚯蚓，南極蝦，三文魚卵 等。  在不同的季節裡針對不同的魚種我們更推出獨一無二的自製假餌，就像一塊吸魚磁鐵一樣。",
        "intro4": "通常都供不應求 被釣友們一掃而空。我們的經驗豐富幫助釣友選擇正確的釣魚配備是我們永遠的主旨。",
        "intro5": ""
    },
    {
        "id": "07",
        "href": "saltwater",
        "title": "海水釣具",
        "img1": "/product/introImg2-1.jpeg",
        "img2": "/product/introImg2-2.jpeg",
        "img3": "/product/introImg2-3.jpeg",
        "intro1": "海釣若是你的最愛，那麼我們的產品選擇絕不會讓你失望的。竿/輪 我們從岸拋，路亞，拖釣 還有鐵板 甚至 還有方便旅行的伸縮竿 等。",
        "intro2": "所有西北岸常用的拖釣三文魚亮板，勺子，假章魚，魚餌頭套 等，還有特別針對我們華人釣友喜愛的 石斑，龍膽 ，比目 而設計的鐵板及軟餌等。",
        "intro3": "面對水底爬的那一些蝦和蟹我們有各式蟹籠/蝦籠，鉛繩，浮球，餌袋，扣夾 及測量尺寸的量尺。我們也有冷凍的魚餌 如沙丁魚，魷魚等生餌，捕蝦的餌料等。",
        "intro4": "不論你是想帶上家人感受一下海釣的樂趣，或是你自己有船但不懂得拖釣三文魚或你想學習如何捕蟹撈蝦等 我們都可提供資訊以及協助。",
        "intro5":""
    },
    {
        "id": "08",
        "href": "flyfishing",
        "title": "飛繩釣具",
        "img1": "/product/introImg3-1.jpeg",
        "img2": "/product/introImg3-2.jpeg",
        "img3": "/product/introImg3-3.jpeg",
        "intro1": "這是一個大部分華人釣友都感到很陌生的領域，但是為它發燒瘋狂的釣友遍布在世界的每一片水域。",
        "intro2": "從釣魚人站的角度到拋投動作，線和線的搭配，毛鉤的選擇，收拉的速度與技巧 無不為了讓水裡的假毛鉤看似真的蟲子而達到騙魚的效果。",
        "intro3": "我們的飛蠅釣裝備充足，從竿子，輪子，浮水線，半浮沉線，全沉線，前導子線，各式小工具 及 上百種各式毛鉤 應有盡有供各位釣友選擇。若是你像店長一樣，熱愛創作自己的毛鉤，我們有各式鉤子，珠子，彩線，各種鳥類/動物 羽毛 等材料，還有毛鉤製作所需的各式工具。我們更不定期的安排毛鉤教學，也有飛蠅釣課程，及戶外實戰教學等。",
        "intro4": "飛蠅釣一但愛上了，沒有回頭路了! ",
        "intro5":""
    },
    {
        "id": "09",
        "href": "crap",
        "title": "臺釣釣具",
        "img1": "/product/introImg4-1.jpeg",
        "img2": "/product/introImg4-2.jpeg",
        "img3": "/product/introImg4-3.jpeg",
        "intro1": "說起鯉魚，鯽魚，白魚，鯰魚 等魚種我們華人釣友肯定不陌生，對這些家鄉魚種大伙心中都有一種特別的情感。在歐洲及亞洲都是主要對象魚種，但是在這裡卻成了老外所謂的非對象魚及下雜魚。",
        "intro2": "當然這不能怪他們，要是他們有對的裝備及懂得漁法他們會發現釣這些魚種的樂趣還有它的挑戰性。",
        "intro3": "在這裡我們沒有任何收費魚池，沒有野放這類魚的魚苗，所有釣場都是天然野釣場，經過多年下來本地台釣釣友實戰經驗及店長精心考量而選擇出來的產品線都是為了針對這一點。",
        "intro4": "我們的台釣手竿從12呎到21呎，支竿架/砲台，抄網，魚護，台釣浮標，標盒，線組盒，綁好線組，母/子線，鉤子，太空豆，鉛皮，鉛座，浮標座 ，失手繩 等 還有釣台，釣箱，釣椅，釣傘，還有我們的自製魚餌等配備齊全。",
        "intro5":"我們也有歐式拋竿沉底釣法所需的裝備，鯉魚拋竿，游動式紡車輪，餌籠，特式鉛錐，頭髮線組，鯉魚餌丸子 等等。"
    },{
        "id": "10",
        "href": "tools",
        "title": "裝備與配件",
        "img1": "/product/introImg5-1.jpeg",
        "img2": "/product/introImg5-2.jpeg",
        "img3": "/product/introImg5-3.jpeg",
        "intro1": "在這裏釣魚你百分之八十的時間會需要水褲/水鞋 等裝備。",
        "intro2": "竿子/輪子來的更重要，沒有一套好的水褲，你無法釣好魚，這裡的水溫無法讓你赤腳站水裡，要是無法涉水那就更不用提及尋找適合的釣點了，或是雨天也無法做釣。",
        "intro3": "好的水鞋能讓你跋山涉水，站上一天也不覺得累。",
        "intro4": "我們有超專業水褲及水鞋，釣魚防水外套，釣魚背心，腰包，工具箱，偏光太陽鏡，手套，襪子，各式帽子，防蚊液，防熊噴 等。",
        "intro5":"還有最重要的一個產品，我們有卑詩省每一個區域的釣魚專業地圖，它告訴你水域名稱，GPS 座標，魚種，深度表，釣技簡介 等 還有鄰近的旅館，加油站 及 城市等豐富釣魚資訊，這是一本幾乎每一位釣友必買的釣魚聖經。"
    }
]